-- MySQL dump 10.13  Distrib 8.0.32, for Win64 (x86_64)
--
-- Host: localhost    Database: user_database
-- ------------------------------------------------------
-- Server version	8.0.32

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `novel_chapters`
--

DROP TABLE IF EXISTS `novel_chapters`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `novel_chapters` (
  `id` int NOT NULL AUTO_INCREMENT,
  `novel_id` int NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `url` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`id`),
  KEY `novel_id` (`novel_id`),
  CONSTRAINT `novel_chapters_ibfk_1` FOREIGN KEY (`novel_id`) REFERENCES `novels` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=120 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `novel_chapters`
--

LOCK TABLES `novel_chapters` WRITE;
/*!40000 ALTER TABLE `novel_chapters` DISABLE KEYS */;
INSERT INTO `novel_chapters` VALUES (1,1,'1.第1章 八百年后','11509403.html'),(2,1,'2.第2章 开启神武印记','11509405.html'),(3,1,'3.第3章 黄极境','11509406.html'),(4,1,'4.第4章 时空秘典','11509408.html'),(5,2,'第一章 那是什么？','7441211.html'),(6,2,'第二章 解冻复生','7441212.html'),(7,2,'第三章 落难的明星？','7441213.html'),(8,2,'第四章 蛋生的孩子','7441214.html'),(9,3,'第1章 巡检司','49434701.html'),(10,3,'第2章 红影','49434702.html'),(11,3,'第3章 李家的剑','55203384.html'),(12,3,'第4章 迷雾渐散（求收藏推荐）','55212565.html'),(13,4,'第一章 孟川和云青萍','8484359.html'),(14,4,'第二章 学其上，仅得其中','42459687.html'),(15,4,'第三章 匠人和宗师','42473276.html'),(16,4,'第四章 这是好事','42477693.html'),(17,5,'第一章：御兽时代','54836693.html'),(18,5,'第二章：技能图鉴','54836694.html'),(19,5,'第三章：初始宠兽规划','54836695.html'),(20,5,'第四章：寻找目标','54836696.html'),(21,6,'引子','13872178.html'),(22,6,'第一章 凉了，要被吃了？','13872181.html'),(23,6,'第二章 被饲养的人类','54035424.html'),(24,6,'第三章 风狼镇','54040686.html'),(25,7,'第一章 旧土','37870731.html'),(26,7,'第二章 韶华易逝','37870732.html'),(27,7,'第三章 续命项目','37870733.html'),(28,7,' 第四章 超自然','37870734.html'),(29,8,'第一章 我有三个相宫','3964727.html'),(30,8,'第二章  不想退婚的未婚妻','53369988.html'),(31,8,'第三章 想要退婚的李洛','53385064.html'),(32,8,'第四章 金龙宝行','53390150.html'),(33,9,'1、想等的人（修）','35113885.html'),(34,9,'2、倒计时（修）','35113886.html'),(35,9,'3、破碎的世界（修）','35113887.html'),(36,9,'4、不止一个（修）','35113888.html'),(37,10,'第一章 林动【新书开张，郑重的求收藏！】','68771.html'),(38,10,'第二章 通背拳','68772.html'),(39,10,'第三章 古怪的石池','68773.html'),(40,10,'第四章 石池之秘','68774.html'),(41,11,'第196章 道心种魔曲（二更）','22511016.html'),(42,11,'第197章 受不受得了（三更求票）','22511020.html'),(43,11,'第198章 狂徒（求票）','22511023.html'),(44,11,'第199章 选宗门','22511028.html'),(45,12,'第一章  门派弃徒','26789607.html'),(46,12,'第二章  天降之火','26789609.html'),(47,12,'第三章  彪悍的叶辰','26789611.html'),(48,12,'第四章  没人要','26789612.html'),(49,13,'第1章 神奇的任务','34675817.html'),(50,13,'第2章 骗局','34675818.html'),(51,13,'第3章 你很有钱？','34675819.html'),(52,13,'第4章 狗眼看人低','34675820.html'),(53,14,'第1章 签到大成圣体，万圣朝拜异象！','48289125.html'),(54,14,'第2章 惊动十八祖，神子身份，零号序列！','48289126.html'),(55,14,'第3章 强大的肾之神藏，古碑签到地','48289127.html'),(56,14,'第4章 君玲珑，七窍玲珑心，谁是君天帝？','48289128.html'),(57,15,'第一章 床底','56853157.html'),(58,15,'第二章 逝者关怀公司','56853158.html'),(59,15,'第三章 坐起','56853159.html'),(60,15,'第四章 身份危机','56853160.html'),(61,16,'第一章 八百年后','34652150.html'),(62,16,'第二章 开启神武印记','34652151.html'),(63,16,'第三章 黄极境','34652152.html'),(64,16,'第四章 时空秘典','34652153.html'),(65,17,'第1章 这是个意外','5082245.html'),(66,17,'第2章 落魄的女城主','5082248.html'),(67,17,'第3章 龙门','5082250.html'),(68,17,'第4章 一种折磨','46026088.html'),(69,18,'剑中仙 第一章：谁敢动我妹！','35839632.html'),(70,18,'剑中仙 第二章：界狱塔！','35839633.html'),(71,18,'剑中仙 第三章：一朝失势，人不如狗','35839634.html'),(72,18,'剑中仙 第四章：天塌下来，哥先顶着！','35840595.html'),(73,19,'第一章 矿奴','8490245.html'),(74,19,'第二章 算计','8490246.html'),(75,19,'第三章 开窍','8490247.html'),(76,19,'第四章 天赋树（感谢池池C的盟主打赏）','8490248.html'),(77,20,'第一章：游离在时间之外的观测者','55195587.html'),(78,20,'第二章：我们也最终将无可挽回的逝去','55195588.html'),(79,20,'第三章：万物起源的时代','55195589.html'),(80,20,'第四章：智慧与生命','55195590.html'),(81,21,'第一章 牢狱之灾','2736396.html'),(82,21,'第二章 妖物作祟','2736398.html'),(83,21,'第三章 仙侠世界一样能推理','2736399.html'),(84,21,'第四章 是时候表演真正的技术了','2736400.html'),(85,22,'仙界篇外传一','34672267.html'),(86,22,'仙界篇外传二','34672268.html'),(87,22,'第一章 狐女','34672271.html'),(88,22,'第二章 石头哥哥','34672272.html'),(89,23,'第1章 忘却难免留个疤','2678315.html'),(90,23,'第2章 套中套','2678316.html'),(91,23,'第3章 发端','2678318.html'),(92,23,'第4章 啪，啪','2678319.html'),(93,24,'第1章 摇骰十一年，一朝气运顶级','52814147.html'),(94,24,'第2章 六道灵体，顶级灵根','52814148.html'),(95,24,'第3章 炼气境七层，该死的魅力','52814149.html'),(96,24,'第4章 魔修胁迫，奖励剑法','52814150.html'),(97,25,'第一章 山边小村','11151180.html'),(98,25,'第二章 青牛镇','11151181.html'),(99,25,'第三章 七玄门','11151184.html'),(100,25,'第四章 炼骨崖','11151186.html'),(101,26,'侠客列传','411787.html'),(102,26,'第一章 星空中的青铜巨棺','411789.html'),(103,26,'第二章 素问','411791.html'),(104,26,'第三章 今昔','411793.html'),(105,27,'第一章论坛里的鬼故事。','36563942.html'),(106,27,'第二章临时讲课','36563943.html'),(107,27,'第三章鬼域。','36563944.html'),(108,27,'第四章恐怖敲门鬼','36563945.html'),(109,28,'第一章：智能修真系统竭诚为您服务！','54246319.html'),(110,28,'第二章：一键托管，在线送命。','54246320.html'),(111,28,'第三章：稳住别慌！','54246321.html'),(112,28,'第四章：一天一托管，魔道远离我。','54246322.html'),(113,29,'第001章 重生万年后','21252832.html'),(114,29,'第002章 符阵','21252833.html'),(115,29,'第003章 天殿天书【第三更】','21252834.html'),(116,29,'第004章 轮回【第四更】','21252835.html'),(117,30,'第一章 他惊人的毅力并无观众','48602644.html'),(118,30,'第二章 洞真墟之主','48602645.html'),(119,30,'第三章 此恨难偿！','48602646.html');
/*!40000 ALTER TABLE `novel_chapters` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-09  4:26:03
